oltaco/Adafruit_nRF52_Bootloader_OTAFIX/lib/sdk11/components/drivers_nrf/pstorage/pstorage_raw.c
    m_round_val              = 0;
    m_cmd_queue.rp           = 0;
    m_cmd_queue.count        = 0;
    m_cmd_queue.flash_access = false;

    for(cmd_index = 0; cmd_index < PSTORAGE_CMD_QUEUE_SIZE; cmd_index++)
    {
        cmd_queue_element_init(cmd_index);
    }
}

/**
 * @brief Function for initializing the pending packets buffer.
 */
static void pending_packets_init(void)
{
    for (int i = 0; i < PENDING_PACKET_COUNT; i++)
    {
        m_pending_packets[i].valid = false;
    }
    m_pending_read_idx = 0;
    m_pending_write_idx = 0;
    m_pending_count = 0;
    m_lazy_erase_active = false;
    m_lazy_erase_page = 0;
    m_processing_pending = false;
}

/**
 * @brief Function for adding a packet to the pending buffer.
 *
 * @param[in] p_handle Pointer to the storage handle.
 * @param[in] p_data   Pointer to the data to buffer.
 * @param[in] size     Size of data in bytes.
 * @param[in] offset   Offset within the storage block.
 *
 * @retval true  If the packet was successfully added.
 * @retval false If the buffer is full or size exceeds maximum.
 */
static bool pending_packet_add(pstorage_handle_t * p_handle, uint8_t * p_data, 
                               uint32_t size, uint32_t offset)
{
    if (m_pending_count >= PENDING_PACKET_COUNT || size > PENDING_PACKET_SIZE)
    {
        return false;
    }

    pending_packet_t * p = &m_pending_packets[m_pending_write_idx];
    p->handle = *p_handle;
    p->offset = offset;
    p->size = size;
    p->p_data_orig = p_data;
    memcpy(p->data, p_data, size);
    p->valid = true;

    m_pending_write_idx = (m_pending_write_idx + 1) % PENDING_PACKET_COUNT;
    m_pending_count++;

    return true;
}

/**
 * @brief Function for getting a pointer to the next pending packet without removing it.
 *
 * @return Pointer to the next pending packet, or NULL if buffer is empty.
 */
static pending_packet_t * pending_packet_peek(void)
{
    if (m_pending_count == 0)
    {
        return NULL;
    }
    return &m_pending_packets[m_pending_read_idx];
}

/**
 * @brief Function for removing the next pending packet from the buffer.
 */
static void pending_packet_pop(void)
{
    if (m_pending_count > 0)
    {
        m_pending_packets[m_pending_read_idx].valid = false;
        m_pending_read_idx = (m_pending_read_idx + 1) % PENDING_PACKET_COUNT;
        m_pending_count--;
    }
}

/**
 * @brief Function for enqueueing a flash access operation.
 *
 * @param[in] opcode         Operation code for the command to queue.
 * @param[in] p_storage_addr Pointer to the destination address.
 * @param[in] p_data_addr    Pointer to the source address containing the data.
 * @param[in] size           Size of data clear or write.
 * @param[in] offset         Offset to the address identified by the source data address.
 *
 * @retval NRF_SUCCESS      If the enqueueing succeeded.
 * @retval NRF_ERROR_NO_MEM In case the queue is full.
 * @return Any error returned by the SoftDevice flash API.
 */
static uint32_t cmd_queue_enqueue(uint8_t             opcode,
                                  pstorage_handle_t * p_storage_addr,
                                  uint8_t           * p_data_addr,
                                  pstorage_size_t     size,
                                  pstorage_size_t     offset)
{
    uint32_t retval;

    if (m_cmd_queue.count != PSTORAGE_CMD_QUEUE_SIZE)
    {
        uint8_t write_index = m_cmd_queue.rp + m_cmd_queue.count;

        if (write_index >= PSTORAGE_CMD_QUEUE_SIZE)
        {
            write_index -= PSTORAGE_CMD_QUEUE_SIZE;
        }

        m_cmd_queue.cmd[write_index].op_code      = opcode;
        m_cmd_queue.cmd[write_index].p_data_addr  = p_data_addr;
        m_cmd_queue.cmd[write_index].storage_addr = (*p_storage_addr);
        m_cmd_queue.cmd[write_index].size         = size;
        m_cmd_queue.cmd[write_index].offset       = offset;
        m_cmd_queue.count++;
        retval                                    = NRF_SUCCESS;
        if (m_cmd_queue.flash_access == false)
        {
            retval = cmd_process();
            if (retval == NRF_ERROR_BUSY)
            {
                // In case of busy error code, it is possible to attempt to access flash.
                retval = NRF_SUCCESS;
            }
        }
    }
    else
    {
        retval = NRF_ERROR_NO_MEM;
    }

    return retval;
}


/**
 * @brief Function for dequeueing a command element.
 *
 * @retval NRF_SUCCESS If the dequeueing succeeded and next command was processed.
 * @return Any error returned by the SoftDevice flash API.
 */
static uint32_t cmd_queue_dequeue(void)
{
    uint32_t retval = NRF_SUCCESS;

    // If any flash operation is enqueued, schedule
    if ((m_cmd_queue.count > 0) && (m_cmd_queue.flash_access == false))
    {
        retval = cmd_process();
        if (retval != NRF_SUCCESS)
        {
            // Flash could be accessed by other modules, hence a busy error is
            // acceptable, but any other error needs to be indicated.
            if (retval == NRF_ERROR_BUSY)
            {
                // In case of busy error code, it is possible to attempt to access flash.
                retval = NRF_SUCCESS;
            }
        }
    }
    else
    {
        // No flash access request pending.
    }

    return retval;
}


/**
 * @brief Function for notifying application of any errors.
 *
 * @param[in] result Result of event being notified.
 * @param[in] p_elem Pointer to the element for which a notification should be given.
 */
static void app_notify(uint32_t result, cmd_queue_element_t * p_elem)
{
    pstorage_ntf_cb_t ntf_cb;
    uint8_t           op_code = p_elem->op_code;

    if (p_elem->storage_addr.module_id < PSTORAGE_NUM_OF_PAGES)
    {
        ntf_cb = m_app_table[p_elem->storage_addr.module_id].cb;
        if (ntf_cb != NULL)
        {
            ntf_cb(&p_elem->storage_addr,
                   op_code,
                   result,
                   p_elem->p_data_addr,
                   p_elem->size);
        }
    }
}

/**
 * @brief Function for notifying application of buffered store completion.
 *
 * @param[in] result   Result of event being notified.
 * @param[in] p_handle Pointer to the storage handle.
 * @param[in] p_data   Pointer to the data buffer.
 * @param[in] size     Size of data in bytes.
 */
static void app_notify_buffered(uint32_t result, pstorage_handle_t * p_handle,
                                uint8_t * p_data, uint32_t size)
{
    if (p_handle->module_id < PSTORAGE_NUM_OF_PAGES)
    {
        pstorage_ntf_cb_t ntf_cb = m_app_table[p_handle->module_id].cb;
        if (ntf_cb != NULL)
        {
            ntf_cb(p_handle, PSTORAGE_STORE_OP_CODE, result, p_data, size);
        }
    }
}

/**
 * @brief Function for processing packets from the pending buffer.
 *
 * @details Attempts to process the next pending packet. If the target page needs
 *          erasing, triggers a lazy erase. Otherwise enqueues the store operation.
 */
static void process_pending_packets(void)
{
    if (m_processing_pending || m_lazy_erase_active || m_cmd_queue.count > 0)
    {
        return;
    }

