oltaco/Adafruit_nRF52_Bootloader_OTAFIX/lib/sdk11/components/drivers_nrf/pstorage/pstorage_raw.c
    pending_packet_t * p = pending_packet_peek();
    if (p == NULL)
    {
        return;
    }

    // Check if this packet needs an erase first
    if (lazy_erase_check_and_trigger(&p->handle, p->size, p->offset))
    {
        // Erase triggered, don't process this packet yet
        return;
    }

    // Page is ready, enqueue the store
    m_processing_pending = true;
    
    uint32_t ret = cmd_queue_enqueue(PSTORAGE_STORE_OP_CODE, &p->handle, p->data, p->size, p->offset);

    if (ret != NRF_SUCCESS)
    {
        m_processing_pending = false;
        pending_packet_pop();
    }
}


/**
 * @brief Function for checking and triggering lazy erase if needed.
 * @param[in]  p_dest Destination address where data is to be stored persistently.
 * @param[in]  size   Size of data to be stored expressed in bytes.
 * @param[in]  offset Offset in bytes to be applied when writing to the block.
 * @retval     true    Lazy erase was triggered.
 * @retval     false   No lazy erase was needed.
 */
static bool lazy_erase_check_and_trigger(pstorage_handle_t * p_handle, pstorage_size_t size, pstorage_size_t offset)
{
    uint32_t target_addr = p_handle->block_id + offset;
    
    if (target_addr < dfu_base_address || dfu_page_erased == NULL)
    {
        return false;
    }
    
    uint32_t rel_addr = target_addr - dfu_base_address;
    uint32_t page_index = rel_addr / PSTORAGE_FLASH_PAGE_SIZE;
    
    // Also check end of packet
    uint32_t end_addr = target_addr + size - 1;
    uint32_t end_rel_addr = end_addr - dfu_base_address;
    uint32_t end_page_index = end_rel_addr / PSTORAGE_FLASH_PAGE_SIZE;

    // Check if start page needs erase
    bool start_needs_erase = (page_index < dfu_image_page_count && !dfu_page_erased[page_index]);
    
    // Check if end page needs erase (and is different from start page)
    bool end_needs_erase = (end_page_index != page_index) && 
                           (end_page_index < dfu_image_page_count && !dfu_page_erased[end_page_index]);

    if (!start_needs_erase && !end_needs_erase)
    {
        return false;
    }
    
    // Determine which page to erase (start page takes priority)
    uint32_t erase_page = start_needs_erase ? page_index : end_page_index;
    
    m_lazy_erase_active = true;
    m_lazy_erase_page = erase_page;

    pstorage_handle_t erase_handle;
    erase_handle.block_id = dfu_base_address + (erase_page * PSTORAGE_FLASH_PAGE_SIZE);
    erase_handle.module_id = p_handle->module_id;

    cmd_queue_enqueue(PSTORAGE_CLEAR_OP_CODE, &erase_handle, NULL,
                     PSTORAGE_FLASH_PAGE_SIZE, 0);
    
    return true;
}


/**
 * @brief Function for handling of system events from SoftDevice.
 *
 * @param[in] sys_evt System event received.
 */
void pstorage_sys_event_handler(uint32_t sys_evt)
{  
    uint32_t retval = NRF_SUCCESS;

    // The event shall only be processed if requested by this module.
    if (m_cmd_queue.flash_access == true)
    {
        cmd_queue_element_t * p_cmd;
        m_cmd_queue.flash_access = false;
        switch (sys_evt)
        {
            case NRF_EVT_FLASH_OPERATION_SUCCESS:
            {
                p_cmd = &m_cmd_queue.cmd[m_cmd_queue.rp];
                m_round_val++;

                bool command_finished = ((m_round_val * SOC_MAX_WRITE_SIZE) >= p_cmd->size);

                if (p_cmd->op_code == PSTORAGE_CLEAR_OP_CODE)
                {
                    command_finished = true;
                }

                if (command_finished)
                {
                    uint8_t queue_rp = m_cmd_queue.rp;
                    uint8_t completed_op = p_cmd->op_code;

                    m_round_val = 0;
                    m_cmd_queue.count--;
                    m_cmd_queue.rp++;

                    if (m_cmd_queue.rp >= PSTORAGE_CMD_QUEUE_SIZE)
                    {
                        m_cmd_queue.rp -= PSTORAGE_CMD_QUEUE_SIZE;
                    }

                    if (m_lazy_erase_active && completed_op == PSTORAGE_CLEAR_OP_CODE)
                    {
                        // Lazy erase completed
                        if (dfu_page_erased != NULL && m_lazy_erase_page < dfu_image_page_count)
                        {
                            dfu_page_erased[m_lazy_erase_page] = 1;
                        }

                        m_lazy_erase_active = false;
                        cmd_queue_element_init(queue_rp);

                        process_pending_packets();
                    }
                    else if (m_processing_pending && completed_op == PSTORAGE_STORE_OP_CODE)
                    {
                        // Store from pending buffer completed
                        pending_packet_t * p = pending_packet_peek();
                        if (p != NULL)
                        {
                            pstorage_handle_t cb_handle = p->handle;
                            uint8_t* cb_data = p->p_data_orig;
                            uint32_t cb_size = p->size;

                            pending_packet_pop();

                            cmd_queue_element_init(queue_rp);
                            
                            // Clear flag BEFORE callback
                            m_processing_pending = false;

                            // Notify application that buffered this buffered store is done
                            app_notify_buffered(retval, &cb_handle, cb_data, cb_size);
                        }
                        else
                        {
                            m_processing_pending = false;
                            cmd_queue_element_init(queue_rp);
                        }
                    }
                    else
                    {
                        app_notify(retval, &m_cmd_queue.cmd[queue_rp]);

                        // Initialize/free the element as it is now processed.
                        cmd_queue_element_init(queue_rp);
                    }
                }

                // Process next queued command OR next pending packet
                if (m_cmd_queue.count > 0)
                {
                    retval = cmd_queue_dequeue();
                }
                else if (m_pending_count > 0 && !m_processing_pending && !m_lazy_erase_active)
                {
                    // Queue is empty but we have pending packets - process one
                    process_pending_packets();
                }
                
                if (retval != NRF_SUCCESS)
                {
                    app_notify(retval, &m_cmd_queue.cmd[m_cmd_queue.rp]);
                }
            }
            break;

            case NRF_EVT_FLASH_OPERATION_ERROR:
                m_lazy_erase_active = false;
                m_processing_pending = false;
                app_notify(NRF_ERROR_TIMEOUT, &m_cmd_queue.cmd[m_cmd_queue.rp]);
                break;

            default:
                // No implementation needed.
                break;
        }
    }
}


/**
 * @brief Function for processing of commands and issuing flash access request to the SoftDevice.
 *
 * @return The return value received from SoftDevice.
 */
static uint32_t cmd_process(void)
{
    uint32_t              retval;
    uint32_t              storage_addr;
    cmd_queue_element_t * p_cmd;

    retval = NRF_ERROR_FORBIDDEN;

    if (m_cmd_queue.count == 0)
    {
        return NRF_SUCCESS;
    }

    p_cmd = &m_cmd_queue.cmd[m_cmd_queue.rp];

